app/controllers/admin_controller.rb

SELECT * FROM `events` LIMIT 0, 4
SELECT count(*) AS count_all FROM `events`
---
  def event_list
    @events = Event.paginate(:all,
      :per_page => PER_PAGE, :page => params[:page])

SELECT * FROM `features` WHERE (`features`.`f_type` = 'event') LIMIT 0, 4
SELECT count(*) AS count_all FROM `features` WHERE (`features`.`f_type` = 'event')
---
  def featured_event_list
    @events = Feature.paginate(:all, :conditions => {:f_type => "event"},
      :per_page => PER_PAGE, :page => params[:page])

SELECT * FROM `gatherings` LIMIT 0, 4
---
  def gathering_list
    @gatherings = Gathering.paginate(:all,
      :per_page => PER_PAGE, :page => params[:page])

SELECT * FROM `features` WHERE (`features`.`f_type` = 'gathering') LIMIT 0, 4
---
  def featured_gathering_list
    @gatherings = Feature.paginate(:all, :conditions => {:f_type => "gathering"},
      :per_page => PER_PAGE, :page => params[:page])

SELECT * FROM `features` WHERE (`features`.`eid` = '108570285827563') LIMIT 1
INSERT INTO `features` (`eid`, `event_link`, `created_at`, `updated_at`, `f_type`) VALUES('108570285827563', 'http://www.facebook.com/event.php?eid=108570285827563', '2010-03-22 07:54:49', '2010-03-22 07:54:49', 'event')
---
  def make_feature
    eid = Utils.get_event_eid(params[:event_link])

    unless eid.blank? || Feature.find_by_eid(eid)
      feature = Feature.new(:eid => eid, :event_link => params[:event_link], :f_type => params[:f_type])
      feature.eid = eid

      feature.save!

SELECT * FROM `events` WHERE (`events`.`eid` = '108570285827563') LIMIT 1
INSERT INTO `events` (`eid`, `category`, `created_at`, `updated_at`, `link`) VALUES('108570285827563', 'Sports Festival', '2010-03-22 07:54:38', '2010-03-22 07:54:38', 'http://www.facebook.com/event.php?eid=108570285827563')
---
  def make_event
    eid = !params[:event][:link].blank? && Utils.get_event_eid(params[:event][:link])
    @event = Event.find_or_create_by_eid(eid)