app/controllers/youth_controller.rb

  def index
    @current_tab = "Home"
    @page = 1
    @featured_events = []
    @featured_gatherings = []
    uids = fbsession.friends_get.friend_list
    @friend_uids = uids[0...PER_PAGE]
    @have_next_friend_page = uids.size > @friend_uids.size

    @friends = fbsession.users_getInfo(:uids => @friend_uids,
            :fields => ["first_name", "pic_square", "profile_url"]).user_list

    featured_event_eids = Feature.find(:all,
      :conditions => {:f_type => "event"}, :limit => PER_PAGE).map{|e| e.eid.to_s}
    @have_next_event_page = Feature.count(:conditions => {:f_type => "event"}) > featured_event_eids.size
---
SELECT * FROM `features` WHERE (`features`.`f_type` = 'event') LIMIT 0, 4
SELECT count(*) AS count_all FROM `features` WHERE (`features`.`f_type` = 'event')
SELECT * FROM `events`

  def guide
    @current_tab = "Guide"
    @cat = params[:cat].to_i
    if @cat > 0 && @cat < 5
      events = Event.find(:all, :condition => {:category => Event::CATEGORIES[@cat - 1]})
    else
      events = Event.find(:all)
    end
    event_eids = events.map{|e| e.eid.to_s}
---
SELECT * FROM `events`

  def gathering
    @current_tab = "Gatherings"
    @your_gatherings = Gathering.paginate(:all, :conditions => {:uid => @uid},
      :per_page => 2, :page => params[:page_your])
---
SELECT * FROM `gatherings` WHERE (`gatherings`.`uid` = '100000225274542') LIMIT 0, 2
SELECT count(*) AS count_all FROM `gatherings` WHERE (`gatherings`.`uid` = '100000225274542')

  def create_gathering
    eid = Utils.get_event_eid(params[:gathering][:event_link])
    if !eid.blank?
      gathering = Gathering.new(params[:gathering])
      gathering.uid = @uid
      if gathering.save
---
SELECT * FROM `gatherings` WHERE (`gatherings`.`eid` = '334824006956') LIMIT 1
INSERT INTO `gatherings` (`name`, `address`, `event_link`, `eid`, `created_at`, `updated_at`, `ic_number`, `uid`, `phone`, `date_of_birth`, `affiliation`, `email`, `race`) VALUES('Fird', NULL, 'http://www.facebook.com/event.php?eid=334824006956', '334824006956', '2010-03-22 10:58:59', '2010-03-22 10:58:59', '8207211055747', '100000225274542', '0167978875', NULL, NULL, 'me@firdouss.com', NULL)

  def volunteer
    @current_tab = "Volunteer"
    @volunteer_uids = Volunteer.find(:all, :limit => PER_PAGE).collect{|v| v.uid}
    @page = 1
    @volunteers = fbsession.users_getInfo(:uids => @volunteer_uids, :fields => ["pic_square", "first_name", "profile_url"]).user_list
    @have_next_volunteer_page = Volunteer.count > PER_PAGE
---
SELECT * FROM `volunteers` WHERE (`volunteers`.`uid` = '100000225274542') LIMIT 1
SELECT * FROM `volunteers` LIMIT 0, 8